simulacoes/hartmann/mhdCentralFoam/Ha=1/system/geometryAndProperties
MW              28.9;
R               #calc "8314.47006651/$MW";
M               0.01;
gamma           1.4;
mu              1.0;
Pr              0.7;
rho             1.0;
h               2.0;
w               0.1;
L               20.0;
Nx              100;
Ny              40;
